---
kind: property
id: P:Autodesk.Revit.DB.Frame.BasisZ
source: html/b0d0e152-5f46-cbb0-bf2c-8f90b4ef59ee.htm
---
# Autodesk.Revit.DB.Frame.BasisZ Property

The third basis vector of the frame.

## Syntax (C#)
```csharp
public XYZ BasisZ { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null